package chat03;

public class java_01_Collection {
    public static void main(String[] args) {
        //TODo 集合
        //问题：什么时候需要一个容纳数据的容量，也就是集合对象？
        //java集合框架中就包含了对不确定个数的数据处理的集合类，
        //问题：为什么不直接用数据，而用集合？
        //数组使用起来不方便，在数据个数不确定的场合，
        //总结：对不确定的有关系的数据进行相同的逻辑处理的场合，使用集合是一个不错的选择

        //TODo 根据数据的不同，Java的集合分为2大体系：
        //1.单一数据体系：Collection接口定义了相关的规则
        //2.成对出现的数据体系：Collection接口定义了相关的规则
        //  所谓的成对的数据，就是2个数据有关系，可以根据第一个数据关联到第二个数据
        //  也称之为键值对数据，（123123，zhangsan）=>(key,value)

    }
}
